artillery/flow.yml
config:
  target: 'https://xxxxxxxx.amazonaws.com/dev'
  phases:
    - duration: 60
      arrivalRate: 20
  payload:
    path: "pizza-order.csv"
    fields:
      - "name"
      - "address"
      - "pizzas"
scenarios:
  - flow:
    - post:
        url: "/order"
        json:
          name: "{{ name }}"
          address : "{{ address }}"
          pizzas: "{{ pizzas }}"
        capture:
          json: "$.order.orderId"
          as: "orderId"
    - think: 10
    - get:
        url: "/order/{{ orderId }}"